In [1]:
import pymysql
import sqlalchemy as alch # python -m pip install --upgrade 'sqlalchemy<2.0'
from getpass import getpass
import pandas as pd
from getpass import getpass
import pandas as pd

In [2]:
password = getpass()

In [3]:
Sakila = "sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{Sakila}"
engine = alch.create_engine(connectionData)


query = "SELECT * FROM actor;"
pd.read_sql_query(query, engine)

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

1. How many copies of the film Hunchback Impossible exist in the inventory system?

In [4]:
#Which columns? Film

Q1 = """
SELECT film.title AS Title, COUNT(inventory.inventory_id) AS Copies
FROM film
    JOIN inventory ON film.film_id = inventory.film_id
WHERE film.title = "Hunchback Impossible"
"""

df = pd.read_sql_query(Q1, engine)
df

                  Title  Copies
0  HUNCHBACK IMPOSSIBLE       6

2. List all films whose length is longer than the average of all the films.

In [5]:
Q2_1 = """
SELECT AVG(length)
FROM film
"""

df1 = pd.read_sql_query(Q2_1, engine)

Q2_2 = """
SELECT title, length
FROM film 
WHERE film.length > (SELECT AVG(length)
                        FROM film)
"""

df2 = pd.read_sql_query(Q2_2, engine)
df2

                title  length
0    AFFAIR PREJUDICE     117
1         AFRICAN EGG     130
2        AGENT TRUMAN     169
3     ALAMO VIDEOTAPE     126
4      ALASKA PHANTOM     136
..                ...     ...
484      WORST BANGER     185
485        WRATH MILE     176
486    WRONG BEHAVIOR     178
487    YOUNG LANGUAGE     183
488        YOUTH KICK     179

[489 rows x 2 columns]

3. Use subqueries to display all actors who appear in the film Alone Trip.

In [6]:
# Q3_1 = """
# SELECT first_name, last_name
# FROM actor
# """
# df3_1 = pd.read_sql_query(Q3_1, engine)

Q3_2joins = """
SELECT film.title, actor.first_name, actor.last_name
FROM actor
JOIN film_actor ON actor.actor_id = film_actor.actor_id 
JOIN film ON film_actor.film_id = film.film_id
WHERE film.title = "Alone Trip"
"""

df3_2 = pd.read_sql_query(Q3_2joins, engine)
df3_2

        title first_name last_name
0  ALONE TRIP         ED     CHASE
1  ALONE TRIP       KARL     BERRY
2  ALONE TRIP        UMA      WOOD
3  ALONE TRIP      WOODY     JOLIE
4  ALONE TRIP    SPENCER      DEPP
5  ALONE TRIP      CHRIS      DEPP
6  ALONE TRIP   LAURENCE   BULLOCK
7  ALONE TRIP      RENEE      BALL

In [7]:
Q3_2 = """
SELECT film.title, actor.first_name, actor.last_name
FROM actor
JOIN film_actor ON actor.actor_id = film_actor.actor_id
JOIN film ON film_actor.film_id = film.film_id
WHERE film.title = 'Alone Trip' AND (actor.first_name, actor.last_name) IN (SELECT first_name, last_name FROM actor)

"""

df3_2 = pd.read_sql_query(Q3_2, engine)
df3_2

        title first_name last_name
0  ALONE TRIP         ED     CHASE
1  ALONE TRIP       KARL     BERRY
2  ALONE TRIP        UMA      WOOD
3  ALONE TRIP      WOODY     JOLIE
4  ALONE TRIP    SPENCER      DEPP
5  ALONE TRIP      CHRIS      DEPP
6  ALONE TRIP   LAURENCE   BULLOCK
7  ALONE TRIP      RENEE      BALL

4. Sales have been lagging among young families, and you wish to target all family movies for a promotion. Identify all movies categorized as family films.

In [8]:
Q4 = """
SELECT film.title, actor.first_name, actor.last_name
FROM actor
JOIN film_actor ON actor.actor_id = film_actor.actor_id
JOIN film ON film_actor.film_id = film.film_id
WHERE film.title = 'Alone Trip' AND (actor.first_name, actor.last_name) IN (SELECT first_name, last_name FROM actor)
"""

df4 = pd.read_sql_query(Q4, engine)
df4

        title first_name last_name
0  ALONE TRIP         ED     CHASE
1  ALONE TRIP       KARL     BERRY
2  ALONE TRIP        UMA      WOOD
3  ALONE TRIP      WOODY     JOLIE
4  ALONE TRIP    SPENCER      DEPP
5  ALONE TRIP      CHRIS      DEPP
6  ALONE TRIP   LAURENCE   BULLOCK
7  ALONE TRIP      RENEE      BALL

5. Get name and email from customers from Canada using subqueries. Do the same with joins. Note that to create a join, you will have to identify the correct tables with their primary keys and foreign keys, that will help you get the relevant information.

In [9]:
Q5_joins = """
SELECT customer.first_name, customer.last_name, customer.email, country.country
FROM customer
JOIN address ON customer.address_id = address.address_id
JOIN city ON address.city_id = city.city_id
JOIN country ON city.country_id = country.country_id
WHERE country.country = "Canada"
"""

df5 = pd.read_sql_query(Q5_joins, engine)
df5

  first_name  last_name                                 email country
0    DERRICK    BOURQUE    DERRICK.BOURQUE@sakilacustomer.org  Canada
1    DARRELL      POWER      DARRELL.POWER@sakilacustomer.org  Canada
2    LORETTA  CARPENTER  LORETTA.CARPENTER@sakilacustomer.org  Canada
3     CURTIS       IRBY        CURTIS.IRBY@sakilacustomer.org  Canada
4       TROY    QUIGLEY       TROY.QUIGLEY@sakilacustomer.org  Canada

In [10]:
# Q5_1 = """
# SELECT country
# FROM country 
# WHERE country = "Canada"
# """
# df5 = pd.read_sql_query(Q5_1, engine)
# df5

Q5_sub = """
SELECT customer.first_name, customer.last_name, customer.email, country.country
FROM customer
JOIN address ON customer.address_id = address.address_id
JOIN city ON address.city_id = city.city_id
JOIN country ON city.country_id = country.country_id
WHERE country.country IN (SELECT country FROM country WHERE country = 'Canada')
"""

df5 = pd.read_sql_query(Q5_sub, engine)
df5

  first_name  last_name                                 email country
0    DERRICK    BOURQUE    DERRICK.BOURQUE@sakilacustomer.org  Canada
1    DARRELL      POWER      DARRELL.POWER@sakilacustomer.org  Canada
2    LORETTA  CARPENTER  LORETTA.CARPENTER@sakilacustomer.org  Canada
3     CURTIS       IRBY        CURTIS.IRBY@sakilacustomer.org  Canada
4       TROY    QUIGLEY       TROY.QUIGLEY@sakilacustomer.org  Canada

6.  Which are films starred by the most prolific actor? Most prolific actor is defined as the actor that has acted in the most number of films. First you will have to find the most prolific actor and then use that actor_id to find the different films that he/she starred.

In [20]:
# Q6_1 = """
# SELECT CONCAT(first_name, " ",last_name) AS full_name
# FROM actor
# """
# df6 = pd.read_sql_query(Q6_1, engine)
# df6

Q6_2 = """
SELECT film.title, CONCAT(first_name, " ",last_name) AS full_name
FROM film 
JOIN film_actor ON film.film_id = film_actor.film_id
JOIN actor ON film_actor.actor_id = actor.actor_id
WHERE CONCAT(actor.first_name, ' ', actor.last_name) IN (SELECT CONCAT(first_name, ' ', last_name)
        FROM actor
        GROUP BY CONCAT(first_name, ' ', last_name)
        HAVING COUNT(actor_id) > 1)
"""
df6_2 = pd.read_sql_query(Q6_2, engine)
df6_2

OperationalError: (pymysql.err.OperationalError) (1055, "Expression #1 of HAVING clause is not in GROUP BY clause and contains nonaggregated column 'sakila.actor.first_name' which is not functionally dependent on columns in GROUP BY clause; this is incompatible with sql_mode=only_full_group_by")
[SQL:
SELECT film.title, CONCAT(first_name, " ",last_name) AS full_name
FROM film
JOIN film_actor ON film.film_id = film_actor.film_id
JOIN actor ON film_actor.actor_id = actor.actor_id
WHERE CONCAT(actor.first_name, ' ', actor.last_name) IN (SELECT CONCAT(first_name, ' ', last_name)
        FROM actor
        GROUP BY CONCAT(first_name, ' ', last_name)
        HAVING COUNT(actor_id) > 1)
]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

7. Films rented by most profitable customer. You can use the customer table and payment table to find the most profitable customer ie the customer that has made the largest sum of payments

In [12]:
Q7_2 = """
SELECT MAX(amount)
FROM payment
"""

Q7_1 = """
SELECT customer.first_name, customer.last_name,film.title,MAX(payment.amount) as max_payment
FROM film
JOIN inventory ON film.film_id = inventory.film_id
JOIN rental ON inventory.inventory_id = rental.inventory_id
JOIN payment ON rental.rental_id = payment.rental_id
JOIN customer ON payment.customer_id = customer.customer_id 
GROUP BY customer.first_name, customer.last_name, film.title
ORDER BY max_payment DESC
"""

df7_1 = pd.read_sql_query(Q7_1, engine)
df7_1

df7_1 = pd.read_sql_query(Q7_1, engine)
df7_1

      first_name last_name              title  max_payment
0          KAREN   JACKSON    SCORPION APOLLO        11.99
1        VANESSA      SIMS    SCORPION APOLLO        11.99
2           ALMA    AUSTIN          SHOW LORD        11.99
3       NICHOLAS  BARFIELD     STING PERSONAL        11.99
4          TANYA   GILBERT        TIES HUNGER        11.99
...          ...       ...                ...          ...
15428       GAIL    KNIGHT      CHASING FIGHT         0.00
15429       BILL     GAVIN    CLEOPATRA DEVIL         0.00
15430       LUCY   WHEELER  CURTAIN VIDEOTAPE         0.00
15431    ALLISON   STANLEY     CYCLONE FAMILY         0.00
15432    ANNETTE     OLSON     DEER VIRGINIAN         0.00

[15433 rows x 4 columns]

8. Get the `client_id` and the `total_amount_spent` of those clients who spent more than the average of the `total_amount` spent by each client.

In [18]:
Q8 = """
SELECT customer.customer_id,SUM(payment.amount)
FROM customer
JOIN payment ON customer.customer_id = payment.customer_id
WHERE payment.amount = (SELECT MAX(amount) FROM payment)
GROUP BY customer.customer_id
"""

df8 = pd.read_sql_query(Q8, engine)
df8

   customer_id  SUM(payment.amount)
0           13                11.99
1          116                11.99
2          195                11.99
3          196                11.99
4          204                11.99
5          237                11.99
6          305                11.99
7          362                11.99
8          591                11.99